In [13]:


# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import time
import json
import csv
import datetime as dt     
from sqlalchemy import create_engine
import psycopg2
date = dt.date.today()

In [14]:
# Files to Load
#color_data_to_load = "lego-database/colors.csv"
theme_data_to_load = "lego-database/themes.csv"
sets_data_to_load = "lego-database/sets.csv"
# Read Colors and Theme Data Files and store into Pandas Data Frames
#colors_data = pd.read_csv(color_data_to_load)
themes_data = pd.read_csv(theme_data_to_load)
sets_data = pd.read_csv(sets_data_to_load)

#colors_data
sets_data.head()

  set_num                        name  year  theme_id  num_parts
0    00-1             Weetabix Castle  1970       414        471
1  0011-2           Town Mini-Figures  1978        84         12
2  0011-3  Castle 2 for 1 Bonus Offer  1987       199          2
3  0012-1          Space Mini-Figures  1979       143         12
4  0013-1          Space Mini-Figures  1979       143         12

In [15]:
themes_data.head()

    id                  name  parent_id
0   18             Star Wars        1.0
1  118           Speed Racer      112.0
2  135          Life On Mars      126.0
3  160  Star Wars Clone Wars      159.0
4  161   Star Wars Episode 2      159.0

In [16]:
#themes_data['id'].isin(sets_data['theme_id'])
comb = pd.DataFrame(sets_data['theme_id'].isin(themes_data['id']))
comb.head()

   theme_id
0     False
1     False
2     False
3     False
4     False

In [17]:
comb = sets_data[sets_data['theme_id'].isin(themes_data['id'])]
comb.rename(columns={'name': 'set name'}, inplace=True)
comb = comb.merge(themes_data.set_index('id')['name'], 'left', left_on='theme_id', right_index=True)
comb.groupby('name').count()
comb

,set_num,set name,year,theme_id,num_parts,name
45,10019-1,Rebel Blockade Runner - UCS,2001,174,1747,Star Wars Episode 4/5/6
54,10026-1,Naboo Starfighter - UCS,2002,172,187,Star Wars Episode 1
57,10030-1,Imperial Star Destroyer - UCS,2002,174,3115,Star Wars Episode 4/5/6
95,10075-1,Spider-Man Action Pack,2002,488,25,Spider-Man
116,10123-1,Cloud City,2003,169,707,Star Wars Episode 4/5/6
...,...,...,...,...,...,...
11651,VP-12,Star Wars Co-Pack of 7121 and 7151,2000,166,2,Star Wars Episode 1
11656,VP-2,Star Wars Co-Pack of 7110 and 7144,2001,169,2,Star Wars Episode 4/5/6
11657,VP-3,Star Wars Co-Pack of 7131 and 7151,2000,166,2,Star Wars Episode 1
11658,VP-4,Star Wars Co-Pack of 7101 7111 and 7171,2000,166,3,Star Wars Episode 1
11662,VP-8,Star Wars Co-Pack of 7130 and 7150,2000,169,2,Star Wars Episode 4/5/6

In [18]:
#create and engine to start putting this in SQL database
rds_connection_string = "postgres:postgres@localhost:5432/legomovies_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [21]:
engine.table_names()

['movie_name', 'sets', 'lego_sets']

In [20]:
comb.to_sql(name='lego_sets', con=engine, if_exists='append', index=False)

In [22]:
 pd.read_sql_query('select * from lego_sets', con=engine).head()

,set_num,set name,year,theme_id,num_parts,name
0,10019-1,Rebel Blockade Runner - UCS,2001,174,1747,Star Wars Episode 4/5/6
1,10026-1,Naboo Starfighter - UCS,2002,172,187,Star Wars Episode 1
2,10030-1,Imperial Star Destroyer - UCS,2002,174,3115,Star Wars Episode 4/5/6
3,10075-1,Spider-Man Action Pack,2002,488,25,Spider-Man
4,10123-1,Cloud City,2003,169,707,Star Wars Episode 4/5/6